In [1]:
#PANDAS
#Creating Data Structures:Series
#From a Python List
import pandas as pd
data = [10, 20, 30, 40]
s = pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [2]:
#From a Dictionary:
data = {'a': 10, 'b': 20, 'c': 30}
s = pd.Series(data)
print(s)

a    10
b    20
c    30
dtype: int64

In [3]:
#Accessing Data in a Series
#By Index
print(s['a'])

10

In [4]:
#Slicing
print(s['a':'b'])

a    10
b    20
dtype: int64

In [5]:
#Common Operations on a Series
#Arithmetic Operations:
s = pd.Series([1, 2, 3])
print(s + 5)  
print(s * 2)

#statistical function
print(s.mean())  
print(s.sum())

0    6
1    7
2    8
dtype: int64
0    2
1    4
2    6
dtype: int64
2.0
6

In [6]:
#checking null values
s = pd.Series([1, None, 3])
print(s.isnull())

0    False
1     True
2    False
dtype: bool

In [7]:
#DATAFRAME

#From a Dictionary
import pandas as pd
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [8]:
#From a List of Lists:
data = [['Alice', 25, 'New York'], ['Bob', 30, 'Los Angeles'], ['Charlie', 35, 'Chicago']]
df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [9]:
#From a NumPy Array:
import numpy as np
data = np.array([[1, 2], [3, 4], [5, 6]])
df = pd.DataFrame(data, columns=['Column1', 'Column2'])
print(df)

   Column1  Column2
0        1        2
1        3        4
2        5        6

In [10]:
#to find head of dataframe
# Create a sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan'],
    'Age': [25, 30, 35, 28, 40],
    'Department': ['IT', 'Finance', 'HR', 'IT', 'Operations'],
    'Salary': [55000, np.nan, 70000, 60000, np.nan],
    'JoiningDate': ['2022-05-15', '2021-03-20', '2018-08-10', '2020-10-05', '2015-02-25']
}
df = pd.DataFrame(data)


print(df)

#viewing data
# View the first 3 rows
print(df.head(3))

# Select 'Name' and 'Salary' columns
print(df[['Name', 'Salary']])

# Filter rows where Age > 30
filtered_df = df[df['Age'] > 30]
print(filtered_df)

#Calculate average salary by department
grouped = df.groupby('Department')['Salary'].mean()
print(grouped)

# Sort by Salary in descending order
sorted_df = df.sort_values(by='Salary', ascending=False)
print(sorted_df)

      Name  Age  Department   Salary JoiningDate
0    Alice   25          IT  55000.0  2022-05-15
1      Bob   30     Finance      NaN  2021-03-20
2  Charlie   35          HR  70000.0  2018-08-10
3    Diana   28          IT  60000.0  2020-10-05
4    Ethan   40  Operations      NaN  2015-02-25
      Name  Age Department   Salary JoiningDate
0    Alice   25         IT  55000.0  2022-05-15
1      Bob   30    Finance      NaN  2021-03-20
2  Charlie   35         HR  70000.0  2018-08-10
      Name   Salary
0    Alice  55000.0
1      Bob      NaN
2  Charlie  70000.0
3    Diana  60000.0
4    Ethan      NaN
      Name  Age  Department   Salary JoiningDate
2  Charlie   35          HR  70000.0  2018-08-10
4    Ethan   40  Operations      NaN  2015-02-25
Department
Finance           NaN
HR            70000.0
IT            57500.0
Operations        NaN
Name: Salary, dtype: float64
      Name  Age  Department   Salary JoiningDate
2  Charlie   35          HR  70000.0  2018-08-10
3    Diana   28          IT  60000.0  2020-10-05
0    Alice   25          IT  55000.0  2022-05-15
1      Bob   30     Finance      NaN  2021-03-20
4    Ethan   40  Operations      NaN  2015-02-25

In [11]:
print(df['Salary'].isnull())
print(df['Salary'].isnull().sum()) 
# Fill missing Salary with the average
df['Salary'] = df['Salary'].fillna(df['Salary'].mean())
print(df)

0    False
1     True
2    False
3    False
4     True
Name: Salary, dtype: bool
2
      Name  Age  Department        Salary JoiningDate
0    Alice   25          IT  55000.000000  2022-05-15
1      Bob   30     Finance  61666.666667  2021-03-20
2  Charlie   35          HR  70000.000000  2018-08-10
3    Diana   28          IT  60000.000000  2020-10-05
4    Ethan   40  Operations  61666.666667  2015-02-25

In [12]:
#TASK

import pandas as pd

# Create a DataFrame with student data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan'],
    'Marks': [45, 82, 56, 30, 91],
    'Grade': ['C', 'A', 'B', 'D', 'A']
}

df = pd.DataFrame(data)

# Filter students with marks > 50
filtered_df = df[df['Marks'] > 50]

print("Original DataFrame:")
print(df)

print("Filtered DataFrame (Marks > 50):")
print(filtered_df)

Original DataFrame:
      Name  Marks Grade
0    Alice     45     C
1      Bob     82     A
2  Charlie     56     B
3    Diana     30     D
4    Ethan     91     A
Filtered DataFrame (Marks > 50):
      Name  Marks Grade
1      Bob     82     A
2  Charlie     56     B
4    Ethan     91     A

In [13]:
#TASK
import pandas as pd

# Create the DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'Salary': [50000, 60000, 70000, 80000, 90000],
    'Department': ['HR', 'Finance', 'Tech', 'Tech', 'HR'],
    'Experience': [2, 5, 8, 10, 12]
}

df = pd.DataFrame(data)

# Apply filtering based on conditions
filtered_df = df[(df['Salary'] > 60000) & (df['Experience'] > 5) & (df['Department'] == 'Tech')]

# Select specific columns
filtered_df = filtered_df[['Name', 'Salary', 'Experience']]

print("Filtered DataFrame:")
print(filtered_df)

Filtered DataFrame:
      Name  Salary  Experience
2  Charlie   70000           8
3    David   80000          10

In [14]:
#TASK
import pandas as pd

# Create a DataFrame with sample employee data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 
             'Frank', 'Grace', 'Hannah', 'Ian', 'Jack'],
    'Age': [25, 30, 35, 28, 40, 32, 27, 29, 31, 33],
    'Salary': [50000, 60000, 55000, 80000, 75000, 
               90000, 40000, 72000, 67000, 85000],
    'Department': ['HR', 'Tech', 'HR', 'Finance', 'Tech', 
                   'Finance', 'HR', 'Tech', 'Finance', 'Tech'],
    'Experience': [2, 5, 4, 6, 8, 7, 3, 4, 6, 10]
}

df = pd.DataFrame(data)

# Sort by Department (ascending) and Salary (descending)
sorted_df = df.sort_values(by=['Department', 'Salary'], ascending=[True, False])
sorted_df
# Display the top 5 rows of the sorted DataFrame
print("Top 5 rows of the sorted DataFrame:")
print(sorted_df.head(5))

Top 5 rows of the sorted DataFrame:
      Name  Age  Salary Department  Experience
5    Frank   32   90000    Finance           7
3    David   28   80000    Finance           6
8      Ian   31   67000    Finance           6
2  Charlie   35   55000         HR           4
0    Alice   25   50000         HR           2

In [15]:
 #DATA MANIPULATION WITH PANDAS
 #Handling missing values and duplicates

import pandas as pd
import numpy as np

# Create a sample DataFrame with missing values and duplicates
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan', 'Alice'],
    'Age': [25, 30, np.nan, 28, 40, 25],
    'Department': ['IT', 'Finance', 'HR', 'IT', 'Operations', 'IT'],
    'Salary': [55000, 65000, 70000, 60000, np.nan, 55000]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

Original DataFrame:
      Name   Age  Department   Salary
0    Alice  25.0          IT  55000.0
1      Bob  30.0     Finance  65000.0
2  Charlie   NaN          HR  70000.0
3    Diana  28.0          IT  60000.0
4    Ethan  40.0  Operations      NaN
5    Alice  25.0          IT  55000.0

In [16]:
#Detect Missing Values
# Check for missing values
print(df.isnull().sum())

Name          0
Age           1
Department    0
Salary        1
dtype: int64

In [17]:
#Drop Missing Values
df_dropped_rows = df.dropna()
print(df_dropped_rows)

    Name   Age Department   Salary
0  Alice  25.0         IT  55000.0
1    Bob  30.0    Finance  65000.0
3  Diana  28.0         IT  60000.0
5  Alice  25.0         IT  55000.0

In [18]:
df_dropped_rows = df.dropna(axis=1)
df_dropped_rows  #missing value with columns are removed

      Name  Department
0    Alice          IT
1      Bob     Finance
2  Charlie          HR
3    Diana          IT
4    Ethan  Operations
5    Alice          IT

In [19]:
#Fill missing values with the column mean
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Salary'] = df['Salary'].fillna(df['Salary'].median())
print(df)

      Name   Age  Department   Salary
0    Alice  25.0          IT  55000.0
1      Bob  30.0     Finance  65000.0
2  Charlie  29.6          HR  70000.0
3    Diana  28.0          IT  60000.0
4    Ethan  40.0  Operations  60000.0
5    Alice  25.0          IT  55000.0

In [20]:
#Handling Duplicates
#Detect Duplicates
# Check for duplicate 
duplicates = df.duplicated()
print(duplicates)

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [21]:
#drop duplicates
# Drop duplicate rows, keeping the first occurrence
df_no_duplicates = df.drop_duplicates()
print(df_no_duplicates)

      Name   Age  Department   Salary
0    Alice  25.0          IT  55000.0
1      Bob  30.0     Finance  65000.0
2  Charlie  29.6          HR  70000.0
3    Diana  28.0          IT  60000.0
4    Ethan  40.0  Operations  60000.0

In [22]:
import pandas as pd
#merging
# Creating datasets
df1 = pd.DataFrame({
    'ID': [1, 2, 3],
    'Name': ['Alice', 'Bob', 'Charlie']
})

df2 = pd.DataFrame({
    'ID': [2, 3, 4],
    'Score': [85, 90, 95]
})

# Merge on a common column
merged = pd.merge(df1, df2)  # Inner Join
print(merged)

   ID     Name  Score
0   2      Bob     85
1   3  Charlie     90

In [23]:
#joining
df3 = pd.DataFrame({
    'Score': [85, 90, 95],
    'Grade': ['B', 'A', 'A']})

df4 = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie']})

# Join on index
joined = df4.join(df3)
print(joined)

      Name  Score Grade
0    Alice     85     B
1      Bob     90     A
2  Charlie     95     A

In [24]:
#concatenation
df5 = pd.DataFrame({'Name': ['Alice', 'Bob'], 'Score': [85, 90]})
df6 = pd.DataFrame({'Name': ['Charlie', 'David'], 'Score': [95, 80]})

# Concatenate row-wise
concat_rows = pd.concat([df5, df6])
print(concat_rows)

      Name  Score
0    Alice     85
1      Bob     90
0  Charlie     95
1    David     80

In [25]:
#import pandas as pd

# Reading a CSV file
#csv_file_path = "path/to/your/file.csv"
#csv_data = pd.read_csv(csv_file_path)

In [26]:
# Reading an Excel file
#excel_file_path = "path/to/your/file.xlsx"
#excel_data = pd.read_excel(excel_file_path)

In [27]:
#TASK
import pandas as pd

# Load the dataset
titanic_data = pd.read_csv("C:/Users/hp/Downloads/titanic_with_missing_values.csv")  # Adjust the file path if needed
# Check for missing values
missing_values = titanic_data.isnull().sum()

# Option 1: Drop rows with missing values
titanic_data_clean = titanic_data.dropna()

# Option 2: Fill missing values (example: filling Age with the median)
titanic_data['Age'].fillna(titanic_data['Age'].median(), inplace=True)
titanic_data['Embarked'].fillna(titanic_data['Embarked'].mode()[0], inplace=True)  # Filling Embarked with the most frequent value

filtered_data = titanic_data[(titanic_data['Age'] > 18) & (titanic_data['Fare'] > 50)]
print("Filtered Data:")
print(filtered_data)

# Compute average fare by class
avg_fare_by_class = titanic_data.groupby('Pclass')['Fare'].mean()
print("\nAverage Fare by Class:")
print(avg_fare_by_class)

Filtered Data:
   PassengerId  Pclass                          Name     Sex   Age  SibSp  \
1            2       2    Cumings, Mrs. John Bradley  female  38.0      1
3            4       1  Futrelle, Mrs. Jacques Heath  female  35.0      1

   Parch     Fare Embarked
1      0  71.2833        C
3      1  53.1000        C

Average Fare by Class:
Pclass
1    30.1750
2    71.2833
3     7.9875
Name: Fare, dtype: float64

C:\Users\hp\AppData\Local\Temp\ipykernel_8740\3377886587.py:13: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_data['Age'].fillna(titanic_data['Age'].median(), inplace=True)
C:\Users\hp\AppData\Local\Temp\ipykernel_8740\3377886587.py:14: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic_data['Embarked'].fillna(titanic_data['Embarked'].mode()[0], inplace=True)  # Filling Embarked with the most frequent value

In [28]:
import pandas as pd

# Load the employee dataset
employee_data = pd.read_csv('C:/Users/hp/Downloads/employee_data.csv')  # Adjust the file path if needed

print(employee_data)

   EmployeeID   Age Department  Salary Joining_Date
0           1  25.0         IT   60000   15-01-2018
1           2  34.0         HR   50000   22-03-2017
2           3   NaN         IT   70000   19-07-2016
3           4  29.0        NaN   45000   11-11-2019
4           5  42.0      Sales   75000   05-02-2020

In [29]:
# Step 1: Check for missing values
missing_values = employee_data.isnull().sum()
print("Missing Values:")
print(missing_values)

Missing Values:
EmployeeID      0
Age             1
Department      1
Salary          0
Joining_Date    0
dtype: int64

In [30]:
# Step 2: Fill missing values
# Example: Fill 'Age' with the median age and 'Department' with the most frequent value
employee_data['Age'] = employee_data['Age'].fillna(employee_data['Age'].median())
employee_data['Department'] = employee_data['Department'].fillna(employee_data['Department'].mode()[0])

In [31]:
# Step 3: Filter data
# Example: Filter employees older than 30 years and earning a salary greater than 50,000
filtered_data = employee_data[(employee_data['Age'] > 30) & (employee_data['Salary'] > 50000)]
print("\nFiltered Data:")
print(filtered_data)

Filtered Data:
   EmployeeID   Age Department  Salary Joining_Date
2           3  31.5         IT   70000   19-07-2016
4           5  42.0      Sales   75000   05-02-2020

In [32]:
# Step 4: Compute the average salary by department
avg_salary_by_department = employee_data.groupby('Department')['Salary'].mean()
print("\nAverage Salary by Department:")
print(avg_salary_by_department)

Average Salary by Department:
Department
HR       50000.000000
IT       58333.333333
Sales    75000.000000
Name: Salary, dtype: float64